<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"8a9f953a022ef0816b549d4cd37160846356f283a7d32502a915c7ac83bf93e9","plan_job_ref":"Job Terraform Plan #28 at https://github.com/cal-itp/cal-bc/actions/runs/18612286919","plan_out_hash":"acc7e8bcd77364bc07ffaa885f74bce1d2511c3a116c2a37806901f713cab8e4","plan_hash":"0d4bc9d4178a7c3b1715c7aef3b2332d08fb2ab0a9b1ce635727ca055f6cd1d1","plan_text_format":"diff","version":"2.2.2","closed":true} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloud-run.google_cloud_run_service.main will be created
+   resource "google_cloud_run_service" "main" {
+       autogenerate_revision_name = true
+       id                         = (known after apply)
+       location                   = "us-west2"
+       name                       = "cal-bc-staging"
+       project                    = "cal-itp-data-infra-staging"
+       status                     = (known after apply)

+       metadata {
+           annotations           = {
+               "run.googleapis.com/ingress" = "all"
            }
+           effective_annotations = {
+               "run.googleapis.com/ingress" = "all"
            }
+           effective_labels      = {
+               "goog-terraform-provisioned" = "true"
            }
+           generation            = 0
+           namespace             = (known after apply)
+           resource_version      = (known after apply)
+           self_link             = (known after apply)
+           terraform_labels      = {
+               "goog-terraform-provisioned" = "true"
            }
+           uid                   = (known after apply)
        }

+       template {
+           metadata {
+               annotations      = {
+                   "autoscaling.knative.dev/maxScale" = "2"
+                   "autoscaling.knative.dev/minScale" = "1"
+                   "generated-by"                     = "terraform"
+                   "run.googleapis.com/client-name"   = "terraform"
                }
+               generation       = (known after apply)
+               labels           = (known after apply)
+               name             = (known after apply)
+               namespace        = (known after apply)
+               resource_version = (known after apply)
+               self_link        = (known after apply)
+               uid              = (known after apply)
            }
+           spec {
+               container_concurrency = (known after apply)
+               service_account_name  = (known after apply)
+               serving_state         = (known after apply)
+               timeout_seconds       = 120

+               containers {
+                   args    = []
+                   command = []
+                   image   = "ghcr.io/cal-itp/cal-bc/cal-bc:development"
+                   name    = (known after apply)

+                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }
+                   env {
                      # At least one attribute in this block is (or was) sensitive,
                      # so its contents will not be displayed.
                    }

+                   ports {
+                       container_port = 8080
+                       name           = "http1"
                    }

+                   resources {
+                       limits = (known after apply)
                    }

+                   startup_probe (known after apply)
                }
            }
        }

+       traffic {
+           latest_revision = true
+           percent         = 100
+           url             = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform Apply #7](https://github.com/cal-itp/cal-bc/actions/runs/18612295830)